## Terraform Plan Output

**Summary:** `Plan: 56 to add, 0 to change, 0 to destroy.`

- 🟢 **Create**: 56
- 🟡 **Update**: 0
- 🔴 **Destroy**: 0

<details><summary>Click to expand full plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_application.github_oidc will be created
  + resource "azuread_application" "github_oidc" {
      + app_role_ids                = (known after apply)
      + application_id              = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "github-EdgeOpsTech-terraform"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + owners                      = [
          + "c089d8e7-1149-4e35-afa2-82d01a3ae4e2",
        ]
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = [
          + "github-actions",
          + "oidc",
          + "terraform",
        ]
      + template_id                 = (known after apply)

      + feature_tags (known after apply)

      + password (known after apply)
    }

  # azuread_application_federated_identity_credential.branches["azure-vm-setup-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "branches" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for azure-vm-setup branch dev"
      + display_name          = "github-EdgeOpsTech-azure-vm-setup-dev"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/azure-vm-setup:ref:refs/heads/dev"
    }

  # azuread_application_federated_identity_credential.branches["azure-vm-setup-main"] will be created
  + resource "azuread_application_federated_identity_credential" "branches" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for azure-vm-setup branch main"
      + display_name          = "github-EdgeOpsTech-azure-vm-setup-main"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/azure-vm-setup:ref:refs/heads/main"
    }

  # azuread_application_federated_identity_credential.branches["edgeops-keyvault-module-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "branches" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for edgeops-keyvault-module branch dev"
      + display_name          = "github-EdgeOpsTech-edgeops-keyvault-module-dev"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-keyvault-module:ref:refs/heads/dev"
    }

  # azuread_application_federated_identity_credential.branches["edgeops-keyvault-module-main"] will be created
  + resource "azuread_application_federated_identity_credential" "branches" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for edgeops-keyvault-module branch main"
      + display_name          = "github-EdgeOpsTech-edgeops-keyvault-module-main"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-keyvault-module:ref:refs/heads/main"
    }

  # azuread_application_federated_identity_credential.branches["edgeops-sub-mgmt-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "branches" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for edgeops-sub-mgmt branch dev"
      + display_name          = "github-EdgeOpsTech-edgeops-sub-mgmt-dev"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-sub-mgmt:ref:refs/heads/dev"
    }

  # azuread_application_federated_identity_credential.branches["edgeops-sub-mgmt-main"] will be created
  + resource "azuread_application_federated_identity_credential" "branches" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for edgeops-sub-mgmt branch main"
      + display_name          = "github-EdgeOpsTech-edgeops-sub-mgmt-main"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-sub-mgmt:ref:refs/heads/main"
    }

  # azuread_application_federated_identity_credential.branches["kv-rbac-setup-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "branches" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for kv-rbac-setup branch dev"
      + display_name          = "github-EdgeOpsTech-kv-rbac-setup-dev"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/kv-rbac-setup:ref:refs/heads/dev"
    }

  # azuread_application_federated_identity_credential.branches["kv-rbac-setup-main"] will be created
  + resource "azuread_application_federated_identity_credential" "branches" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for kv-rbac-setup branch main"
      + display_name          = "github-EdgeOpsTech-kv-rbac-setup-main"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/kv-rbac-setup:ref:refs/heads/main"
    }

  # azuread_application_federated_identity_credential.branches["super-webapp-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "branches" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for super-webapp branch dev"
      + display_name          = "github-EdgeOpsTech-super-webapp-dev"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/super-webapp:ref:refs/heads/dev"
    }

  # azuread_application_federated_identity_credential.branches["super-webapp-main"] will be created
  + resource "azuread_application_federated_identity_credential" "branches" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for super-webapp branch main"
      + display_name          = "github-EdgeOpsTech-super-webapp-main"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/super-webapp:ref:refs/heads/main"
    }

  # azuread_application_federated_identity_credential.branches["terraform-azure-ops-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "branches" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for terraform-azure-ops branch dev"
      + display_name          = "github-EdgeOpsTech-terraform-azure-ops-dev"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/terraform-azure-ops:ref:refs/heads/dev"
    }

  # azuread_application_federated_identity_credential.branches["terraform-azure-ops-main"] will be created
  + resource "azuread_application_federated_identity_credential" "branches" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for terraform-azure-ops branch main"
      + display_name          = "github-EdgeOpsTech-terraform-azure-ops-main"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/terraform-azure-ops:ref:refs/heads/main"
    }

  # azuread_application_federated_identity_credential.environments["azure-vm-setup-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for azure-vm-setup environment dev"
      + display_name          = "github-EdgeOpsTech-azure-vm-setup-dev"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/azure-vm-setup:environment:dev"
    }

  # azuread_application_federated_identity_credential.environments["azure-vm-setup-prod"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for azure-vm-setup environment prod"
      + display_name          = "github-EdgeOpsTech-azure-vm-setup-prod"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/azure-vm-setup:environment:prod"
    }

  # azuread_application_federated_identity_credential.environments["azure-vm-setup-stage"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for azure-vm-setup environment stage"
      + display_name          = "github-EdgeOpsTech-azure-vm-setup-stage"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/azure-vm-setup:environment:stage"
    }

  # azuread_application_federated_identity_credential.environments["azure-vm-setup-test"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for azure-vm-setup environment test"
      + display_name          = "github-EdgeOpsTech-azure-vm-setup-test"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/azure-vm-setup:environment:test"
    }

  # azuread_application_federated_identity_credential.environments["edgeops-keyvault-module-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for edgeops-keyvault-module environment dev"
      + display_name          = "github-EdgeOpsTech-edgeops-keyvault-module-dev"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-keyvault-module:environment:dev"
    }

  # azuread_application_federated_identity_credential.environments["edgeops-keyvault-module-prod"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for edgeops-keyvault-module environment prod"
      + display_name          = "github-EdgeOpsTech-edgeops-keyvault-module-prod"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-keyvault-module:environment:prod"
    }

  # azuread_application_federated_identity_credential.environments["edgeops-keyvault-module-stage"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for edgeops-keyvault-module environment stage"
      + display_name          = "github-EdgeOpsTech-edgeops-keyvault-module-stage"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-keyvault-module:environment:stage"
    }

  # azuread_application_federated_identity_credential.environments["edgeops-keyvault-module-test"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for edgeops-keyvault-module environment test"
      + display_name          = "github-EdgeOpsTech-edgeops-keyvault-module-test"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-keyvault-module:environment:test"
    }

  # azuread_application_federated_identity_credential.environments["edgeops-sub-mgmt-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for edgeops-sub-mgmt environment dev"
      + display_name          = "github-EdgeOpsTech-edgeops-sub-mgmt-dev"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-sub-mgmt:environment:dev"
    }

  # azuread_application_federated_identity_credential.environments["edgeops-sub-mgmt-prod"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for edgeops-sub-mgmt environment prod"
      + display_name          = "github-EdgeOpsTech-edgeops-sub-mgmt-prod"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-sub-mgmt:environment:prod"
    }

  # azuread_application_federated_identity_credential.environments["edgeops-sub-mgmt-stage"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for edgeops-sub-mgmt environment stage"
      + display_name          = "github-EdgeOpsTech-edgeops-sub-mgmt-stage"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-sub-mgmt:environment:stage"
    }

  # azuread_application_federated_identity_credential.environments["edgeops-sub-mgmt-test"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for edgeops-sub-mgmt environment test"
      + display_name          = "github-EdgeOpsTech-edgeops-sub-mgmt-test"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-sub-mgmt:environment:test"
    }

  # azuread_application_federated_identity_credential.environments["kv-rbac-setup-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for kv-rbac-setup environment dev"
      + display_name          = "github-EdgeOpsTech-kv-rbac-setup-dev"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/kv-rbac-setup:environment:dev"
    }

  # azuread_application_federated_identity_credential.environments["kv-rbac-setup-prod"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for kv-rbac-setup environment prod"
      + display_name          = "github-EdgeOpsTech-kv-rbac-setup-prod"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/kv-rbac-setup:environment:prod"
    }

  # azuread_application_federated_identity_credential.environments["kv-rbac-setup-stage"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for kv-rbac-setup environment stage"
      + display_name          = "github-EdgeOpsTech-kv-rbac-setup-stage"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/kv-rbac-setup:environment:stage"
    }

  # azuread_application_federated_identity_credential.environments["kv-rbac-setup-test"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for kv-rbac-setup environment test"
      + display_name          = "github-EdgeOpsTech-kv-rbac-setup-test"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/kv-rbac-setup:environment:test"
    }

  # azuread_application_federated_identity_credential.environments["super-webapp-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for super-webapp environment dev"
      + display_name          = "github-EdgeOpsTech-super-webapp-dev"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/super-webapp:environment:dev"
    }

  # azuread_application_federated_identity_credential.environments["super-webapp-prod"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for super-webapp environment prod"
      + display_name          = "github-EdgeOpsTech-super-webapp-prod"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/super-webapp:environment:prod"
    }

  # azuread_application_federated_identity_credential.environments["super-webapp-stage"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for super-webapp environment stage"
      + display_name          = "github-EdgeOpsTech-super-webapp-stage"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/super-webapp:environment:stage"
    }

  # azuread_application_federated_identity_credential.environments["super-webapp-test"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for super-webapp environment test"
      + display_name          = "github-EdgeOpsTech-super-webapp-test"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/super-webapp:environment:test"
    }

  # azuread_application_federated_identity_credential.environments["terraform-azure-ops-dev"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for terraform-azure-ops environment dev"
      + display_name          = "github-EdgeOpsTech-terraform-azure-ops-dev"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/terraform-azure-ops:environment:dev"
    }

  # azuread_application_federated_identity_credential.environments["terraform-azure-ops-prod"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for terraform-azure-ops environment prod"
      + display_name          = "github-EdgeOpsTech-terraform-azure-ops-prod"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/terraform-azure-ops:environment:prod"
    }

  # azuread_application_federated_identity_credential.environments["terraform-azure-ops-stage"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for terraform-azure-ops environment stage"
      + display_name          = "github-EdgeOpsTech-terraform-azure-ops-stage"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/terraform-azure-ops:environment:stage"
    }

  # azuread_application_federated_identity_credential.environments["terraform-azure-ops-test"] will be created
  + resource "azuread_application_federated_identity_credential" "environments" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for terraform-azure-ops environment test"
      + display_name          = "github-EdgeOpsTech-terraform-azure-ops-test"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/terraform-azure-ops:environment:test"
    }

  # azuread_application_federated_identity_credential.pull_request["azure-vm-setup"] will be created
  + resource "azuread_application_federated_identity_credential" "pull_request" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for azure-vm-setup pull requests"
      + display_name          = "github-EdgeOpsTech-azure-vm-setup-pr"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/azure-vm-setup:pull_request"
    }

  # azuread_application_federated_identity_credential.pull_request["edgeops-keyvault-module"] will be created
  + resource "azuread_application_federated_identity_credential" "pull_request" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for edgeops-keyvault-module pull requests"
      + display_name          = "github-EdgeOpsTech-edgeops-keyvault-module-pr"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-keyvault-module:pull_request"
    }

  # azuread_application_federated_identity_credential.pull_request["edgeops-sub-mgmt"] will be created
  + resource "azuread_application_federated_identity_credential" "pull_request" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for edgeops-sub-mgmt pull requests"
      + display_name          = "github-EdgeOpsTech-edgeops-sub-mgmt-pr"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/edgeops-sub-mgmt:pull_request"
    }

  # azuread_application_federated_identity_credential.pull_request["kv-rbac-setup"] will be created
  + resource "azuread_application_federated_identity_credential" "pull_request" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for kv-rbac-setup pull requests"
      + display_name          = "github-EdgeOpsTech-kv-rbac-setup-pr"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/kv-rbac-setup:pull_request"
    }

  # azuread_application_federated_identity_credential.pull_request["super-webapp"] will be created
  + resource "azuread_application_federated_identity_credential" "pull_request" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for super-webapp pull requests"
      + display_name          = "github-EdgeOpsTech-super-webapp-pr"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/super-webapp:pull_request"
    }

  # azuread_application_federated_identity_credential.pull_request["terraform-azure-ops"] will be created
  + resource "azuread_application_federated_identity_credential" "pull_request" {
      + application_id        = (known after apply)
      + application_object_id = (known after apply)
      + audiences             = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id         = (known after apply)
      + description           = "GitHub federated identity for terraform-azure-ops pull requests"
      + display_name          = "github-EdgeOpsTech-terraform-azure-ops-pr"
      + id                    = (known after apply)
      + issuer                = "https://token.actions.githubusercontent.com"
      + subject               = "repo:EdgeOpsTech/terraform-azure-ops:pull_request"
    }

  # azuread_service_principal.github_oidc will be created
  + resource "azuread_service_principal" "github_oidc" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_id              = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = [
          + "github-actions",
          + "oidc",
          + "terraform",
        ]
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azurerm_resource_group.tfstate will be created
  + resource "azurerm_resource_group" "tfstate" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-tfstate"
      + tags     = (known after apply)
    }

  # azurerm_role_assignment.rbac_assigner will be created
  + resource "azurerm_role_assignment" "rbac_assigner" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/subscriptions/bba7ddf1-057e-4d04-afd9-4032cd79dc9d"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.storage_blob_data_contributor will be created
  + resource "azurerm_role_assignment" "storage_blob_data_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.sub_contributor will be created
  + resource "azurerm_role_assignment" "sub_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/bba7ddf1-057e-4d04-afd9-4032cd79dc9d"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_storage_account.tfstate will be created
  + resource "azurerm_storage_account" "tfstate" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = "edgeopstechtfstate"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-tfstate"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = (known after apply)

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true

          + delete_retention_policy {
              + days                     = 7
              + permanent_delete_enabled = false
            }
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_container.tfstate["azure-vm-setup"] will be created
  + resource "azurerm_storage_container" "tfstate" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "azure-vm-setup"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "edgeopstechtfstate"
    }

  # azurerm_storage_container.tfstate["edgeops-keyvault-module"] will be created
  + resource "azurerm_storage_container" "tfstate" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "edgeops-keyvault-module"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "edgeopstechtfstate"
    }

  # azurerm_storage_container.tfstate["edgeops-sub-mgmt"] will be created
  + resource "azurerm_storage_container" "tfstate" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "edgeops-sub-mgmt"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "edgeopstechtfstate"
    }

  # azurerm_storage_container.tfstate["kv-rbac-setup"] will be created
  + resource "azurerm_storage_container" "tfstate" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "kv-rbac-setup"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "edgeopstechtfstate"
    }

  # azurerm_storage_container.tfstate["super-webapp"] will be created
  + resource "azurerm_storage_container" "tfstate" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "super-webapp"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "edgeopstechtfstate"
    }

  # azurerm_storage_container.tfstate["terraform-azure-ops"] will be created
  + resource "azurerm_storage_container" "tfstate" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "terraform-azure-ops"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "edgeopstechtfstate"
    }

  # azurerm_storage_container.tfstate_main will be created
  + resource "azurerm_storage_container" "tfstate_main" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "tf-state-submgmt-np-main"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "edgeopstechtfstate"
    }

Plan: 56 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + arm_client_id               = (known after apply)
  + arm_subscription_id         = "bba7ddf1-057e-4d04-afd9-4032cd79dc9d"
  + arm_tenant_id               = (sensitive value)
  + backend_config              = {
      + azure-vm-setup          = {
          + client_id            = (known after apply)
          + container_name       = "azure-vm-setup"
          + key                  = "terraform.tfstate"
          + resource_group_name  = "rg-tfstate"
          + storage_account_name = "edgeopstechtfstate"
          + use_oidc             = true
        }
      + edgeops-keyvault-module = {
          + client_id            = (known after apply)
          + container_name       = "edgeops-keyvault-module"
          + key                  = "terraform.tfstate"
          + resource_group_name  = "rg-tfstate"
          + storage_account_name = "edgeopstechtfstate"
          + use_oidc             = true
        }
      + edgeops-sub-mgmt        = {
          + client_id            = (known after apply)
          + container_name       = "edgeops-sub-mgmt"
          + key                  = "terraform.tfstate"
          + resource_group_name  = "rg-tfstate"
          + storage_account_name = "edgeopstechtfstate"
          + use_oidc             = true
        }
      + kv-rbac-setup           = {
          + client_id            = (known after apply)
          + container_name       = "kv-rbac-setup"
          + key                  = "terraform.tfstate"
          + resource_group_name  = "rg-tfstate"
          + storage_account_name = "edgeopstechtfstate"
          + use_oidc             = true
        }
      + super-webapp            = {
          + client_id            = (known after apply)
          + container_name       = "super-webapp"
          + key                  = "terraform.tfstate"
          + resource_group_name  = "rg-tfstate"
          + storage_account_name = "edgeopstechtfstate"
          + use_oidc             = true
        }
      + terraform-azure-ops     = {
          + client_id            = (known after apply)
          + container_name       = "terraform-azure-ops"
          + key                  = "terraform.tfstate"
          + resource_group_name  = "rg-tfstate"
          + storage_account_name = "edgeopstechtfstate"
          + use_oidc             = true
        }
    }
  + container_names             = {
      + azure-vm-setup          = "azure-vm-setup"
      + edgeops-keyvault-module = "edgeops-keyvault-module"
      + edgeops-sub-mgmt        = "edgeops-sub-mgmt"
      + kv-rbac-setup           = "kv-rbac-setup"
      + super-webapp            = "super-webapp"
      + terraform-azure-ops     = "terraform-azure-ops"
    }
  + github_secrets              = (sensitive value)
  + service_principal_object_id = (known after apply)
  + storage_account_name        = "edgeopstechtfstate"
  + storage_resource_group      = "rg-tfstate"
```
</details>